// Напишите программу, которая на вход принимает число и выдает его квадрат (число умноженное 
// на само себя).

Console.WriteLine("Введите число: ");
int number = int.Parse(Console.ReadLine());
int result = number * number;
Console.WriteLine ("Квадрат числа равен = " + result);